using System;
using System.Threading;

namespace CyberSecurityChatbot
{
    public static class AsciiArt
    {
        public static void DisplayLogo()
        {
            Console.ForegroundColor = ConsoleColor.Cyan;
            Console.Clear();

            string[] logo = new string[]
            {
"========================================================",
"",
"███╗   ██╗██╗   ██╗ █████╗ ██╗  ██╗ █████╗ ███████╗ █████╗ ",
"████╗  ██║██║   ██║██╔══██╗██║ ██╔╝██╔══██╗╚══███╔╝██╔══██╗",
"██╔██╗ ██║██║   ██║███████║█████╔╝ ███████║  ███╔╝ ███████║",
"██║╚██╗██║╚██╗ ██╔╝██╔══██║██╔═██╗ ██╔══██║ ███╔╝  ██╔══██║",
"██║ ╚████║ ╚████╔╝ ██║  ██║██║  ██╗██║  ██║███████╗██║  ██║",
"╚═╝  ╚═══╝  ╚═══╝  ╚═╝  ╚═╝╚═╝  ╚═╝╚═╝  ╚═╝╚══════╝╚═╝  ╚═╝",
"",
"        CYBERSECURITY AWARENESS CHATBOT",
"                by THIMNA NYAKAZA",
"========================================================"
            };

            foreach (string line in logo)
            {
                Console.WriteLine(line);
                Thread.Sleep(80); // animation speed
            }

            Console.ResetColor();
        }
    }
}
